Public Attributes | List of all members
API_PropertyObjectRefType Struct Reference
Element Manager API
The property object reference record. More...
#include <APIdefs_Elements.h>
 Public Attributes
Int32  | libIndex
Index of the library part, this is a property object.
bool  | assign
This member is true, if the property object is invidually assignment.
Detailed Description
The property object reference record.
Remarks
This structure is used when you want to get the property objectlist of an element. See the ACAPI_Element_GetPropertyObjects function.
Member Data Documentation
◆ assign
 API_PropertyObjectRefType::assign
This member is true, if the property object is invidually assignment.
◆ libIndex
 API_PropertyObjectRefType::libIndex
Index of the library part, this is a property object.